<?php
session_start();
$name = $_SESSION['name'];
$score = $_SESSION['score'];
if (isset($_SESSION['page'])) {
    if ($_SESSION['page'] != 11 and $_SESSION['page'] != 12) {
        header('Location: ../logic/switcher.php');
    }
}else {
    header('Location: ../index.php');
}
$message = match (true) {
    $score >= 1 && $score <= 3 => "بیانگر علائم افسردگی، غم و اندوه و ناامیدی است. این فرد ممکن است احساس بی ارزشی، بی انگیزگی و افکار منفی داشته باشد.نشان دهنده سطح بالای اضطراب، نگرانی و تنش عصبی. این فرد ممکن است علائمی مانند بی قراری، تحریک پذیری، مشکل در تمرکز و خواب آشفته را تجربه کند.نشان دهنده علائم جسمانی مرتبط با استرس، مانند سردرد، درد معده و خستگی است. این فرد ممکن است به دنبال توجه و حمایت اطرافیان باشد."."<br>"."<b>تجویز:رفتن به گذشته با ماشین زمان و دادن کاندوم به پدرتان برای جلوگیری از بدنیا آمدن شما</b>",
    $score >= 3 && $score <= 6 => "نشان دهنده علائم وسواس فکری-اجباری، مانند افکار وسواسی، رفتارهای اجباری و ترس از دست دادن کنترل است.بیانگر علائم جسمانی مرتبط با استرس، مانند سردرد، درد معده و خستگی است. این فرد ممکن است به دنبال توجه و حمایت اطرافیان باشد.نشان دهنده سطح متوسط اضطراب و نگرانی است."."<br>"."<b>تجویز:شیاف کردن 10 عدد اسفتامینوفن برای آرام شدن شما</b>",
    $score >= 6 && $score <= 10 => "نشان دهنده گرایش به نقش های مردانه سنتی، مانند قاطعیت، استقلال و رقابت است.بیانگر تمایل به رفتارهای ضد اجتماعی، قانون شکنی و عدم مسئولیت پذیری است. این فرد ممکن است به دنبال جلب توجه و تحریک باشد.نشان دهنده سطح متوسط افسردگی است. این فرد ممکن است گاه به گاه احساس غم و اندوه و ناامیدی کند."."<br>"."<b>تجویز:شما افسردگی دارید و نیاز است تا بیایید حالتان را خوب کنیم</b>",
};
$title ='پایان تست';
$content = <<<CONTENT
<section dir="rtl" id="main" class="bg-body-tertiary vh-100 d-flex align-items-center justify-content-center">
<div class="text-center w-50">
    <h5>نام: <span>$name</span></h5>
    <h5>امتیاز: <span>$score</span></h5>
    <p>$message</p>
    <form action="logic/restart.php" method="post">
        <button class="btn btn-danger" type="submit">شروع دوباره</button>
    </form>
    <br>
    <a href="index.php" class="btn btn-info">صفحه اصلی</a>
</div>
</section>
CONTENT;
include_once 'layouts/master.php';
?>
